app/controllers/feed_controller.rb

SELECT * FROM "feeds"
---
  def list
    @feeds=Feed.all

INSERT INTO "feeds" ("url") VALUES(E'test') RETURNING "feed_id"
---
  def create
    Feed.create :url => request.POST['url']