app/controllers/format_controller.rb

  def edit
    @fmt=Format.find(:first,:conditions => { :format_id => params[:id] })
---
SELECT * FROM "format" WHERE ("format"."format_id" = -77400438) LIMIT 1

  def update
    fmt=Format.find(:first,:conditions => { :format_id => params[:id] })
    fmt.parameter=request.POST['parameter']
    fmt.save
---
SELECT * FROM "format" WHERE ("format"."format_id" = E'4') LIMIT 1
UPDATE "format" SET "parameter" = E'//article' WHERE "format_id" = 4

  def create
    format=Format.create(:algorithm => 'xpath',
                         :parameter => request.POST['parameter'])
---
INSERT INTO "format" ("parameter", "algorithm", "feed_id") VALUES(E'//article', E'xpath', NULL) RETURNING "format_id"