app/controllers/hint_controller.rb

  def blank
    @categories=Category.find(:all,:conditions=>["meta_id=:meta_id",{:meta_id => 1}])
---
SELECT * FROM "category" WHERE (meta_id=1) LIMIT 1

  def new
    # item * hint -> ()
    item=Item.create :feed_id => 0,
                     :link => request.POST['url']

    @i=request.POST['category']
    Hint.create :meta_id => 1,
                :category_id => request.POST['category'],
                :item_id => item.item_id,
                :processed => false
---
INSERT INTO "item" ("feed_id", "link") VALUES(0, E'test-link-7') RETURNING "item_id"
INSERT INTO "hint" ("meta_id", "processed", "category_id", "item_id") VALUES(1, NULL, NULL, NULL) RETURNING "hint_id"