app/controllers/item_controller.rb

  def apply
    render :text => "Nein."
    fmt=Format.find(:first,:conditions => { :format_id => params[:id2] })
    @item=Item.find(:first,:conditions => { :item_id => params[:id1] })
---
SELECT * FROM "format" WHERE ("format"."format_id" = E'3') LIMIT 1
SELECT * FROM "item" WHERE ("item"."item_id" = E'159') LIMIT 1

  def learn
    fmt=Format.find(:first,:conditions => { :format_id => params[:id2] })
    @item=Item.find(:first,:conditions => { :item_id => params[:id1] })
---
SELECT * FROM "format" WHERE ("format"."format_id" IS NULL) LIMIT 1
SELECT * FROM "item" WHERE ("item"."item_id" IS NULL) LIMIT 1